// ---------------------------------------------------------------------
//	h2/groovy/delete/h2_delete.groovy
//
//					Jun/09/2011
//
// ---------------------------------------------------------------------
import groovy.sql.Sql

import sql_manipulate
// ---------------------------------------------------------------------
class h2_delete
{
// -------------------------------------------------------------------
static void main (args)
{
	println ("*** 開始 ***");

	def id_in=args[0]

	println (id_in)

	def sql = Sql.newInstance \
		("jdbc:h2:file:/var/tmp/h2/cities", "sa", "", "org.h2.Driver");

	sql_manipulate.delete_proc (sql,id_in)

	sql.close ()

	println ("*** 終了 ***");
}

// ---------------------------------------------------------------------
}
// ---------------------------------------------------------------------
