/* ------------------------------------------------------------------- */
/*
	text_read.pl

						Aug/21/2011
*/
/* ------------------------------------------------------------------- */
write_code(-1).
write_code(C) :- put(C).

type_file(X) :-
    see(X),
    repeat,
    get0(C),
    write_code(C),
    C == -1,
    !,
    seen.

text_read :-
	format('*** 開始 ***~n'),
	type_file('/var/tmp/plain_text/cities.txt'),
	format('*** 終了 ***~n'),
	halt.

/* ------------------------------------------------------------------- */
