#! /usr/bin/slsh
%
%		text_create.sl
%
%						Aug/30/2013
%
% --------------------------------------------------------------------
require ("cmdopt");

print ("*** 開始 ***");
print ("*** start ***");

print (__argv[1]);

variable file_out = __argv[1];

variable fp = fopen (file_out, "w");


variable line = "t2381	名古屋	94157	1963-3-11\n";
line += "t2382	豊橋	52671	1963-2-14\n";
line += "t2383	岡崎	18632	1963-9-17\n";
line += "t2384	一宮	34751	1963-5-9\n";
line += "t2385	蒲郡	91276	1963-6-12\n";
line += "t2386	常滑	79235	1963-7-7\n";
line += "t2387	大府	26583	1963-8-15\n";
line += "t2388	瀬戸	15369	1963-9-18\n";
line += "t2389	犬山	92461	1963-10-25\n";

fputs (line,fp);
() = fclose (fp);


print ("*** end ***");
print ("*** 終了 ***");
% --------------------------------------------------------------------
