?- assert(mul(N,M,A):- A is N * M).
true.

?- mul(10,20,X).
X = 200.

?- maplist(mul,[1,2,3],[4,5,6],X).
X = [4, 10, 18].

?- maplist(plus,[1,2,3],[4,5,6],X).
X = [5, 7, 9].
