// ------------------------------------------------------------------
//	notyet_jaxer_read.js
//
//						Jan/26/2011
// ------------------------------------------------------------------
function notyet_gen_proc ()
{
	var obj_bb = new Array ();

	obj_bb[0] = gen_record (1411,'横浜',987560,'1979-2-11');
	obj_bb[1] = gen_record (1412,'川崎',58132,'1979-1-25');
	obj_bb[2] = gen_record (1413,'小田原',78747,'1979-5-02');
	obj_bb[3] = gen_record (1414,'藤沢',38706,'1979-6-22');
	obj_bb[4] = gen_record (1415,'相模原',40756,'1979-8-15');
	obj_bb[5] = gen_record (1416,'厚木',20701,'1979-9-12');
	obj_bb[6] = gen_record (1417,'横須賀',40389,'1979-4-23');
	obj_bb[7] = gen_record (1418,'鎌倉',80347,'1979-8-3');
	obj_bb[8] = gen_record (1419,'逗子',21342,'1979-3-17');

	var obj_aa = {cities: obj_bb};
	var str_aa = to_json_proc (obj_aa);

	return	str_aa
}

// ------------------------------------------------------------------
